#!/usr/bin/python3

"""
SRDS -> Selkup.ORG Spec convertation schema
"""

strict = [
    [
        ["ә"],
        "ӭ"
    ],
    [
        ["ә̄"],
        "ӭ̄"
    ],
    [
        ["а́"],
        "ӓ"
    ],
    [
        ["а́̄"],
        "ӓ̄"
    ],
    [
        ["i"],
        "и̇"
    ],
    [
        ["ī"],
        "и̇̄"
    ],
    [
        ["ҙ"],
        "дз"
    ],
    [
        ["қ"],
        "ӄ"
    ],
    [
        ["ң"],
        "ӈ"
    ],
    [
        ["дж"],
        "җ"
    ],
    [
        ["ӌ"],
        "ҷ"
    ],
]

soft = [
    [
        ["ж"],
        "җ"
    ],
    [
        ["х"],
        "ҳ"
    ],
    [
        ["ч"],
        "ҷ"
    ]
]
